taskt/Core/Automation/Commands/UIAutomationGroup/UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand.dot
digraph "UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand" {
"UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand" -> "AUIElementActionFromWindowSomethingByXPathCommands";
"UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand" -> "IOneWindowNameProperties";
"AUIElementActionFromWindowSomethingByXPathCommands" -> "AUIElementActionFromSomethingByXPathCommands";
"AUIElementActionFromWindowSomethingByXPathCommands" -> "IWindowUIElementResultProperties";
"AUIElementActionFromSomethingByXPathCommands" -> "AUIElementActionSomewayCommands";
"AUIElementActionFromSomethingByXPathCommands" -> "IUIElementChildrenSearchXPathProperties";
"AUIElementActionFromSomethingByXPathCommands" -> "IUIElementDescendantsSearchXPathProperties";
"AUIElementActionSomewayCommands" -> "ScriptCommand";
"AUIElementActionSomewayCommands" -> "IUIElementUIElementActionSomewayProperties";
"AUIElementActionSomewayCommands" -> "IFromWindowNameResultsProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
