taskt/Core/Automation/Commands/UIAutomationGroup/UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand.puml
@startuml
UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand --> AUIElementActionFromWindowSomethingByXPathCommands
UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand --> IOneWindowNameProperties
AUIElementActionFromWindowSomethingByXPathCommands --> AUIElementActionFromSomethingByXPathCommands
AUIElementActionFromWindowSomethingByXPathCommands --> IWindowUIElementResultProperties
AUIElementActionFromSomethingByXPathCommands --> AUIElementActionSomewayCommands
AUIElementActionFromSomethingByXPathCommands --> IUIElementChildrenSearchXPathProperties
AUIElementActionFromSomethingByXPathCommands --> IUIElementDescendantsSearchXPathProperties
AUIElementActionSomewayCommands --> ScriptCommand
AUIElementActionSomewayCommands --> IUIElementUIElementActionSomewayProperties
AUIElementActionSomewayCommands --> IFromWindowNameResultsProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
